# StructFramJoinStatus Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructFramJoinStatus Property
ParameterTypeId Class See Also
---
"Join Status"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructFramJoinStatus { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructFramJoinStatus As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructFramJoinStatus {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace